'use strict';

/*-------------------------------------------------------------------------------------------------------------------*/

let a = 1;

switch (a) {
    /*Здесь требуются фигурные скобки для создания локальных контекстов.*/
    case 1: {
        let b = 4;
        console.log(b);
        break;
    }

    case 2: {
        let b = 3;
        console.log(b);
        break;
    }

    default:
        break;
}

if (a === 1) {
    let b = 4;
    console.log(b);
} else if (a === 2) {
    let b = 3;
    console.log(b);
}

console.log('--------------------------------------');

/*-------------------------------------------------------------------------------------------------------------------*/

let c = 2;

/*Если "break" нет, то выполнение пойдет ниже по следующим "case", при этом остальные проверки игнорируются.*/
switch (c) {
    case 1:
        console.log(1);

    case 2:
        console.log(2); // 2

    case 3:
        console.log(3); // 3

    default:
        console.log(4); // 4
}

console.log('--------------------------------------');

/*-------------------------------------------------------------------------------------------------------------------*/

let d = 2;

/*В условии можно использовать операторы.*/
switch (++d) {
    case 3:
        console.log(3);
        break;

    case 2:
        console.log(2);
        break;

    default:
        console.log('default');
        break;
}

console.log('--------------------------------------');

/*-------------------------------------------------------------------------------------------------------------*/

/*Проверка в "switch/case" всегда строгая.*/