'use strict';

/*-------------------------------------------------------------------------------------------------------------------*/

/*Модули предоставляют специальный синтаксис "export default", чтобы можно было импортировать что-то одно под любым
именем, не используя фигурные скобки. Нужно помнить, что в файле может быть не более одного "export default".*/
export default 5;

// export default let e = 5; // Так можно только с функциями и классами

// export default function func01() {
//     console.log(6);
// };

// export default class Class01 {
//     constructor() {

//     };
// };