'use strict';

/*--------------------------------------------------------------------------------------------------------------------*/

/*Метод "flat()" возвращает новый массив, в котором все элементы вложенных подмассивов рекурсивно поднимаются наверх на 
указанный уровень.*/
const array01 = [1, 2, [3, 4, [5, 6, [7, 8]]]];
const array02 = array01.flat();
console.log(array02); // [1, 2, 3, 4, [5, 6, [7, 8]]];
const array03 = array01.flat(2);
console.log(array03); // [1, 2, 3, 4, 5, 6, [7, 8]];
const array04 = array01.flat(Infinity);
console.log(array04); // [ 1, 2, 3, 4, 5, 6, 7, 8 ]
console.log(array01); // [1, 2, [3, 4, [5, 6, [7, 8]]]]

console.log('--------------------------------------');

/*--------------------------------------------------------------------------------------------------------------------*/

/*Метод "with()" возвращает новый массив, в котором элемент по указанному индексу замененяется указанным значением.*/
const array05 = [1, 2, [3, 4, [5, 6, [7, 8]]]];
const array06 = array05.with(1, 99);
console.log(array06); // [1, 99, [3, 4, [5, 6, [7, 8]]]]
console.log(array05); // [1, 2, [3, 4, [5, 6, [7, 8]]]]

console.log('--------------------------------------');

/*--------------------------------------------------------------------------------------------------------------------*/

/*Метод "toSpliced()" возвращает новый массив, в котором некоторые элементы удалены или заменены.*/
const array07 = [1, 2, 3, 4, 5, 6, 7, 8];
const array08 = array07.toSpliced(1);
console.log(array08); // [ 1 ]
const array09 = array07.toSpliced(1, 2);
console.log(array09); // [ 1, 4, 5, 6, 7, 8 ]
const array10 = array07.toSpliced(1, 2, 99);
console.log(array10); // [ 1, 99, 4, 5, 6, 7, 8 ]
const array11 = array07.toSpliced(1, 2, 99, 100, 101);
console.log(array11); // [ 1, 99, 100, 101, 4, 5, 6, 7, 8 ]
console.log(array07); // [ 1, 2, 3, 4, 5, 6, 7, 8 ]

console.log('--------------------------------------');

/*--------------------------------------------------------------------------------------------------------------------*/

/*Метод "toReversed()" возвращает новый массив с расположенными в обратном порядке элементами.*/
const array12 = [1, 2, 3, 4, 5, 6, 7, 8];
const array13 = array12.toReversed();
console.log(array13); // [ 8, 7, 6, 5, 4, 3, 2, 1 ]
console.log(array12); // [ 1, 2, 3, 4, 5, 6, 7, 8 ]

console.log('--------------------------------------');

/*--------------------------------------------------------------------------------------------------------------------*/

/*Метод "toSorted()" возвращает новый массив с отсортированными в возрастающем порядке элементами. Этот метод, как и 
метод "sort()", может принимать callback-функцию в качестве параметра для кастомной сортировки.*/
const array14 = [8, 7, 6, 5, 4, 3, 2, 1];
const array15 = array14.toSorted();
console.log(array15); // [ 1, 2, 3, 4, 5, 6, 7, 8 ]
console.log(array14); // [ 8, 7, 6, 5, 4, 3, 2, 1 ]

console.log('--------------------------------------');