/*-------------------------------------------------------------------------------------------------------------*/

console.log(typeof NaN); // number

/*-------------------------------------------------------------------------------------------------------------*/

let i = 0
do {
    i += 1
    console.log(i)
} while (i < 3); // 1 2 3

/*-------------------------------------------------------------------------------------------------------------*/

/*Как использовать геттер. При обращении к свойству "title", будет вызываться функция "title()".*/
const book = {
    _title: 'The Lord of the Rings',
    _author: 'J.R.R.Tolkien',

    get title() {
        return this._title
    },
};

console.log(book.title);