'use strict';

/*-------------------------------------------------------------------------------------------------------------------*/

/*Контекст вызова определяется в момент вызова функции.*/
let obj1 = {
    a: 1,

    func: function () {
        console.log(this);
        console.log(this.x);
        console.log('--------------------------------------');
    }
};

setTimeout(obj1.func, 1000); // Window, отдали просто "чертеж" функции, без контекста объекта "obj1".

/*Стрелочная функция тоже вызовется через Window как "чертеж", но внутренний код уже будет работать с "obj1".*/
setTimeout(() => {
    console.log(this); // Window
    obj1.func(); // { a: 1 ...}
    console.log('--------------------------------------');
}, 1200);

/*Анонимная функция тоже вызовется через Window как "чертеж", но внутренний код уже будет работать с "obj1".*/
setTimeout(function () {
    console.log(this); // Window
    obj1.func(); // { a: 1 ...}
    console.log('--------------------------------------');
}, 1400);

function doSmth() {
    console.log(this); // Window

    let func = () => {
        console.log(this); // Window
        obj1.func(); // { a: 1 ...}
        console.log('--------------------------------------');
    };

    func();
};

/*Функции "doSmth()" и "func()" тоже вызовется через Window, но внутренний код уже будет работать с "obj1".*/
setTimeout(doSmth, 1600);