const canvas = document.getElementsByClassName('canvas-one')[0];
const ctx = canvas.getContext('2d');

/*-------------------------------------------------------------------------------------------------------------*/

ctx.setTransform(2, 0, 0, 1, 0, 0);
ctx.fillRect(0, 0, 100, 100);

ctx.setTransform(1, 0, 0, 2, 0, 0);
ctx.fillRect(0, 100, 100, 100);

ctx.setTransform(1, 0, 0, 1, 0, 0);

/*Метод "transform()" делает тоже самое, что и метод "setTransform()", только перед началом своей работы не
сбрасывает текущее преобразование матрицы.*/
ctx.transform(2, 0, 0, 1, 0, 0);
ctx.fillRect(200, 0, 100, 100);

/*Здесь масштабирование уже будет как вертикали, так и по горизонтали.*/
ctx.transform(1, 0, 0, 2, 0, 0);
ctx.fillRect(200, 100, 100, 100);

/*-------------------------------------------------------------------------------------------------------------*/

/*Метод "resetTransform()" сбрасывает текущее преобразование матрицы. То есть он повторяет работу 
"setTransform(1, 0, 0, 1, 0, 0)".*/
ctx.resetTransform();

ctx.fillStyle = 'red';
ctx.fillRect(800, 0, 100, 100);