'use strict';

/*--------------------------------------------------------------------------------------------------------------------*/

/*Inversion of Control (Инверсии управления) - это принцип, при котором управление потоком программы передается от 
пользовательского кода к фреймворку или контейнеру. Если нет фреймворка или библиотеки, то этот принцип можно 
реализовать путем использования callback-функций. Очень часто IoC реализуется через паттерн Dependency Injection.

Inversion of Control Container (IoC-контейнер) - это инструмент или библиотека, используемая для реализации IoC.*/