'use strict';

/*-------------------------------------------------------------------------------------------------------------------*/

/*Оператор нулевого слияния "??" возвращает первый аргумент, если он не null/undefined, иначе второй.*/

let a = null;
let b = 7;
let result01;

result01 = a ?? b;
console.log(result01); // 7

a = undefined;
result01 = a ?? b;
console.log(result01); // 7

a = 23;
result01 = a ?? b;
console.log(result01); // 23

console.log('--------------------------------------');

/*-------------------------------------------------------------------------------------------------------------*/

/*Последовательность из операторов "??" позволяет получить первое значение из списка, которое не является "null" 
или "undefined".*/

let c = null;
let d = undefined;
let e = '';
let f = 0;
let g = NaN;
let h = false;
let i = 7;

let result02 = c ?? d ?? e ?? f ?? g ?? h ?? i;
console.log(result02); // ''

console.log('--------------------------------------');

/*-------------------------------------------------------------------------------------------------------------*/

/*Приоритет оператора "??" такой же, как и у "||".*/

/*По соображениям безопасности JavaScript запрещает использование оператора ?? вместе с && и ||, если приоритет 
явно не указан при помощи круглых скобок.*/

// let j = 1 && 2 ?? 3; // Error
let j = (1 && 2) ?? 3;
console.log(j); // 2

console.log('--------------------------------------');

/*-------------------------------------------------------------------------------------------------------------*/

/*Оператор нулового присваивания "??=" присваивает левому операнду значение правого операнда, если левый операнд
не определен (null/undefined).*/

let k = null;

k ??= 20;
console.log(k); // 20

k = undefined;
k ??= 20;
console.log(k); // 20

k = 30;
k ??= 20;
console.log(k); // 30