'use strict';

/*Это тоже модуль, хоть в HTML-файле этого не указали. Видимо к этому привело то, что мы импортировали отсюда что-то.*/

/*-------------------------------------------------------------------------------------------------------------------*/

console.log(' ');
console.log('--- we are in module01.js ---');

export function func01FromModule01() { console.log('module01 a') };

console.log('code from module01.js');

/*-------------------------------------------------------------------------------------------------------------------*/

export let obj01FromModule01 = { a: 1 };

/*-------------------------------------------------------------------------------------------------------------------*/

/*В модуле "this" не определен.*/
console.log(this); // undefined

/*-------------------------------------------------------------------------------------------------------------------*/

export let obj02FromModule01 = { d: 4 };