'use strict';

/*-------------------------------------------------------------------------------------------------------------------*/

/*Третий параметр функции "setTimeout()" позволяет указывать параметры для callback-функции в первом параметре функции
"setTimeout()". Это также работает и для функции "setInterval()".*/
let obj01 = { a: 1 };

setTimeout(
    (obj) => { console.log(obj) }, // Object { a: 4, b: 3 }
    3000,
    obj01);

obj01.a = 2;

setTimeout(
    () => { obj01.b = 3 },
    1000);

obj01.a = 4;