'use strict';

/*-------------------------------------------------------------------------------------------------------------------*/

/*Опциональная цепочка "?." останавливает вычисление и возвращает undefined, если значение перед "?." равно undefined 
или null.*/

let obj1 = {};

console.log(obj1.a?.b); // undefined

/*Переменная перед "?." должна быть объявлена.*/

// console.log(obj2?.a); // obj2 is not defined

console.log('--------------------------------------');

/*-------------------------------------------------------------------------------------------------------------------*/

/*Опциональную цепочку "?." можно использовать с вызовом функций.*/

let obj3 = {
    doSomething1: function () {
        console.log('123');
    }
};

let obj4 = {};

obj3.doSomething1?.(); // '123'.
obj4.doSomething1?.(); // ошибки не будет, ничего не произойдет и код пойдет дальше.


console.log('--------------------------------------');

/*-------------------------------------------------------------------------------------------------------------------*/

/*Опциональную цепочку "?." можно использовать с обращением к свойствам через "[]".*/

let key = 'a';

let obj5 = {
    a: 1
};

let obj6 = null;

console.log(obj5?.[key]); // 1.
console.log(obj6?.[key]); // undefined, ошибки не будет и код пойдет дальше.