'use strict';

/*--------------------------------------------------------------------------------------------------------------------*/

/* Метод массивов "flatMap()" возвращает новый массив, сформированный путем применения callback-функции к каждому
элементу исходного массива, а затем все элементы вложенных подмассивов рекурсивно поднимаются наверх на 1 уровень.*/
const array_01 = [1, 2, 3, 4];
/*Увидим [ 1, 2, 2, 4, 3, 6, 4, 8 ], а не [ [ 1, 2 ], [ 2, 4 ], [ 3, 6 ], [ 4, 8 ] ].*/
console.log(array_01.flatMap((x) => [x, x * 2]));
/*Увидим [ [ 2 ], [ 4 ], [ 6 ], [ 8 ] ], а не [ 2, 4, 6, 9].*/
console.log(array_01.flatMap((x) => [[x * 2]]));